{
  "language": {
    "en": "US - English",
    "es": "ES - Español"
  },
  "presentation": {
    "desc": "Desarrollador de páginas web & aplicaciones móviles",
    "btnAbout": "Sobre mi",
    "btnContact": "Contacto"
  },
  "aboutMe": {
    "title": "Sobre Mí",
    "desc": "Soy Juan Gabriel Bentiez Rinas, desarrollador Full-Stack y Mobile con más de 2 años de experiencia. Graduado como Analista programador universitario en la Universidad Nacional del Nordeste (UNNE), me gusta aprender nuevas tecnologías y explorar herramientas innovadoras."
  },
  "experience": {
    "title": "Experiencia",
    "experiences": {
      "almoby": {
        "title": "Desarrollador Full-Stack - Almoby Software Solutions",
        "date": "Noviembre 2024 – Actualidad",
        "items": {
          "1": "Creé el Front-End en React y el Back-End en Python para un sistema de tickets utilizado en diversos eventos (carnavales del interior de Corrientes, boliches,recitales, etc), migrando los DNS desde Hostinguer a Cloudflare y desplegando la aplicación con Cloudflare y Railway",
          "2": "Desarrollé el Front-End de una plataforma consignataria a partir de diseños en Figma y documentaciones. Además, configuré la infraestructura de hosting en AWS para la aplicación: \n\nMigré el dominio a Route 53, agregando los registros necesarios y delegando el DNS en NIC.ar.\nSolicité certificados SSL en ACM (us-east-1) y configuré CloudFront para servir el sitio con HTTPS\nImplementé el despliegue en S3 con hosting estático, asegurando el enrutamiento de las rutas internas de React."
        }
      },
      "macrointell": {
        "title": "Full-Stack & Mobile Developer - MacroIntell",
        "date": "Abril 2023 – Actualidad",
        "items": {
          "1": "Lidero el equipo de desarrollo Mobile, estableciendo objetivos de sprint y mentorando a desarrolladores trainee.",
          "2": "Desarrollé una billetera virtual con Expo y TypeScript, aplicando principios de Clean Architecture y patrón Repositorio, realizando modificaciones a nivel nativo para iOS con Swift y para Android con Kotlin.",
          "3": "Construí una app de marketplace con React Native y TypeScript, priorizando rendimiento y usabilidad. Implementé pruebas unitarias con Jest.",
          "4": "Implementé el proceso de distribución de las apps en Android (pruebas internas) y iOS (TestFlight), y me encargué del proceso de enviar las aplicaciones a revisión para su posterior aprobación.",
          "5": "Implementé una librería UI interna reutilizable en diferentes proyectos de la empresa.",
          "6": "Colaboré en el desarrollo de una plataforma web educativa con NextJS, NodeJS, ExpressJS, Docker y MongoDB, orientada a microservicios y con gestión de contenido a través de un Back-Office."
        }
      },
      "freelance": {
        "title": "Front-End - Freelance",
        "date": "Septiembre 2023 – Septiembre 2024",
        "items": {
          "1": "Desarrollo de nuevas secciones en el Front-End de una plataforma de gestión de redes sociales de influencers con NextJS y TypeScript.",
          "2": "Implementación de nuevas funcionalidades en el Back-Office de la misma plataforma utilizando ReactJS."
        }
      }
    }
  },
  "technologies": {
    "title": "Tecnologías",
    "categories": {
      "frontEnd": "Front-End",
      "backEnd": "Back-End",
      "mobile": "Mobile",
      "devOps": "DevOps",
      "tools": "Herramientas"
    }
  },
  "studies": {
    "title": "Estudios",
    "analist": {
      "title": "Analista Programador Universitario - UNNE",
      "date": "Febrero 2020 – Finalizado"
    },
    "downloadCv": "Descargar CV"
  },
  "contacts": {
    "title": "Contacto",
    "desc": "Me interesan los proyectos freelance. Sin embargo, si tenés preguntas o propuestas de otro tipo, no dudes en contactarme."
  },
  "projects": {
    "title": "Proyectos",
    "projectType": {
      "back": "Back-End",
      "front": "Front-End",
      "mobile": "Mobile",
      "design": "Diseño",
      "ios": "iOS",
      "android": "Android"
    },
    "gymback": {
      "title": "GymBack - Backend para Gestión de Gimnasios",
      "description": "Sistema backend para la gestión de gimnasios, permitiendo a usuarios y administradores administrar planes, rutinas y ejercicios. Desarrollado con Node.js, Express, MongoDB Atlas y TypeScript, siguiendo una arquitectura modular escalable."
    },
    "visortv_back": {
      "title": "Visor TV - Backend",
      "description": "Backend para la gestión modular de pantallas y su contenido, permitiendo a administradores y operadores gestionar widgets de clima, cámaras de seguridad y carruseles de información. Desarrollado con Node.js, Express, MongoDB Atlas y TypeScript"
    },
    "almotick_back": {
      "title": "Almotick - Backend para Gestión de Eventos",
      "description": "Plataforma backend para la gestión y venta de entradas de eventos, permitiendo a usuarios visualizar eventos destacados, adquirir entradas y gestionar eventos. Arquitectura moderna y escalable. Desarrollado con Python, Flask y MongoDB Atlas"
    },
    "hre": {
      "title": "HRE - Gestión de Remates",
      "description": "Aplicación web para la gestión de subastas de ganado, optimizando la administración de lotes, remates y visualización de catálogos. Desarrollado con tecnologías modernas y arquitectura limpia. Desarrollado con React, Vite y TypeScript, siguiendo una arquitectura limpia."
    },
    "visortv_front": {
      "title": "Visor TV - Administración de Pantallas",
      "description": "Sistema de administración de pantallas con diferentes roles de usuario. Permite la creación y edición de pantallas con widgets de clima, cámaras en vivo y carruseles de información. Desarrollado con React, Vite y TypeScript, siguiendo una arquitectura limpia"
    },
    "almotick_front": {
      "title": "Almotick - Gestión de Eventos y Entradas",
      "description": "Aplicación web para la gestión de eventos y venta de entradas, con una interfaz moderna y responsiva. Desarrollado con React y TypeScript. Desarrollado con React, Vite y TypeScript, siguiendo una arquitectura limpia"
    },
    "gymapp": {
      "title": "Gym App",
      "description": "Aplicación móvil que permite a los usuarios gestionar su rutina de entrenamiento en un gimnasio, ofreciendo seguimiento personalizado y planificación de ejercicios. Desarrollado con React Native, Expo y TypeScript, siguiendo una arquitectura limpia"
    },
    "portfolio": {
      "title": "Portfolio",
      "description": "Diseño web y mobile de este portfolio."
    },
    "viewProject": "Ver proyecto",
    "viewRepository": "Ver repositorio"
  }
}
